reference_cfd/openfoam_v2606/flat_plate/medium_incidence_10deg/0/U
FoamFile
{
    version 2.0;
    format ascii;
    class volVectorField;
    object U;
}

dimensions [0 1 -1 0 0 0 0];
internalField uniform (0 0 0);

boundaryField
{
    airInlet
    {
        type fixedValue;
        value uniform (3.125667 0 17.72654);
    }
    targetWall
    {
        type noSlip;
    }
    farField
    {
        type pressureInletOutletVelocity;
        value uniform (0 0 0);
    }
}
