reference_cfd/openfoam_v2606/flat_plate/medium_incidence_10deg/0/nut
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object nut;
}

dimensions [0 2 -1 0 0 0 0];
internalField uniform 0;

boundaryField
{
    airInlet
    {
        type calculated;
        value uniform 0;
    }
    targetWall
    {
        type nutkWallFunction;
        value uniform 0;
    }
    farField
    {
        type calculated;
        value uniform 0;
    }
}
