reference_cfd/openfoam_v2606/flat_plate/medium_incidence_10deg/0/p
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object p;
}

dimensions [1 -1 -2 0 0 0 0];
internalField uniform 101325;

boundaryField
{
    airInlet
    {
        type zeroGradient;
        value uniform 101325;
    }
    targetWall
    {
        type zeroGradient;
    }
    farField
    {
        type fixedValue;
        value uniform 101325;
    }
}
