reference_cfd/openfoam_v2606/flat_plate/medium_incidence_10deg/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    (-0.15 -0.15 0)
    (-0.15 -0.15 0.24)
    ( 0.15 -0.15 0.24)
    ( 0.15 -0.15 0)
    (-0.15  0.15 0)
    (-0.15  0.15 0.24)
    ( 0.15  0.15 0.24)
    ( 0.15  0.15 0)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (48 24 24) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    airInlet
    {
        type patch;
        faces ((0 3 7 4));
    }
    targetWall
    {
        type wall;
        faces ((1 5 6 2));
    }
    farField
    {
        type patch;
        faces
        (
            (0 1 2 3)
            (4 7 6 5)
            (0 4 5 1)
            (3 2 6 7)
        );
    }
);

mergePatchPairs
(
);
